app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("user_id", "task", "dead_line", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 13], ["task", "あああああああああああああああ"], ["dead_line", "2018-08-22 00:00:00"], ["created_at", "2018-08-22 16:43:01.805570"], ["updated_at", "2018-08-22 16:43:01.805570"]]
---
    def create

        paramtheday = params[:task]['dead_line(1i)']+'-'+params[:task]['dead_line(2i)']+'-'+params[:task]['dead_line(3i)']
        @datetheday = Date.parse(paramtheday)

        @task = Task.new(
            user_id: params[:task][:user_id],
            task: params[:task][:task],
            dead_line: @datetheday
        )
        if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
---
    def edit
        @task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
UPDATE "tasks" SET "dead_line" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["dead_line", "2018-07-01 00:00:00"], ["updated_at", "2018-08-16 16:11:07.640174"], ["id", 14]]
---
    def update
        paramtheday = params[:task]['dead_line(1i)']+'-'+params[:task]['dead_line(2i)']+'-'+params[:task]['dead_line(3i)']
        @datetheday = Date.parse(paramtheday)

        @task = Task.find_by(id: params[:id])
        @task.task = params[:task][:task]
        @task.dead_line = @datetheday
        if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 28]]
---
    def destroy
        @task = Task.find_by(id: params[:id])
        @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
UPDATE "tasks" SET "finished" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["finished", 1], ["updated_at", "2018-08-23 00:51:19.968878"], ["id", 40]]
---
    def finished_change
        @task = Task.find_by(id: params[:id])
        @task.finished = true
        if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
UPDATE "tasks" SET "finished" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["finished", 0], ["updated_at", "2018-08-24 04:10:16.891961"], ["id", 46]]
---
    def unfinished_change
        @task = Task.find_by(id: params[:id])
        @task.finished = false
        if @task.save