app/controllers/visions_controller.rb

    def index
        @vision = Vision.find_by(user_id: current_user.id)
        @tasks = Task.where(user_id: current_user.id).order('dead_line ASC')
---
SELECT  "visions".* FROM "visions" WHERE "visions"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY dead_line ASC  [["user_id", 2]]

    def new
        @vision = Vision.new

        #ビジョンが登録されていたら一覧画面へリダイレクト
        if Vision.find_by(user_id: current_user.id)
---
SELECT  "visions".* FROM "visions" WHERE "visions"."user_id" = ? LIMIT ?  [["user_id", 11], ["LIMIT", 1]]

    def create
        paramtheday = params[:vision]['dead_line(1i)']+'-'+params[:vision]['dead_line(2i)']+'-'+params[:vision]['dead_line(3i)']
        @datetheday = Date.parse(paramtheday)

        @vision = Vision.new(
            user_id: params[:vision][:user_id],
            vision: params[:vision][:vision],
            dead_line: @datetheday
        )
        if @vision.save
---
INSERT INTO "visions" ("user_id", "vision", "dead_line", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 12], ["vision", "毎日ブランク頑張って痩せる"], ["dead_line", "2018-11-22 00:00:00"], ["created_at", "2018-08-22 15:21:59.299367"], ["updated_at", "2018-08-22 15:21:59.299367"]]

    def edit
        @vision = Vision.find_by(id: params[:id])
---
SELECT  "visions".* FROM "visions" WHERE "visions"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

    def update
        @vision = Vision.find_by(id: params[:id])

        paramtheday = params[:vision]['dead_line(1i)']+'-'+params[:vision]['dead_line(2i)']+'-'+params[:vision]['dead_line(3i)']
        @datetheday = Date.parse(paramtheday)

        @vision.vision = params[:vision][:vision]
        @vision.dead_line = @datetheday

        if @vision.save
---
SELECT  "visions".* FROM "visions" WHERE "visions"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "visions" SET "vision" = ?, "updated_at" = ? WHERE "visions"."id" = ?  [["vision", "憧れの女性とつきあうよ"], ["updated_at", "2018-09-05 15:31:26.816747"], ["id", 29]]